ATOM
NUMBER
VAR 
COMPLEX (functor ari)
NONE

1 atom 
3 complex(not) not/1
5 none 
7 atom 
9 number

2 Var 
4 atom 
6 complex(tiga) tiga/2
8 var 
10 none


--------------------------
fakta rule 
clause -> jumlah baris
predikat -> unique facts

atom
var
Complex -> arity
number 

, and
; or

------------------------------------
Slide 2

UNIFICATION
mia mia 
mia azis

Cowo = azis 
Ganteng =  evander
ganteng =/= azis

atom -> varianble
ganteng(nikolai) %nikolai = ando
ganteng(evander)
ganteng(gildas)
ganteng(benedictus)

?- ganteng(X)
X = nikolai
X = evander
X = gildas 
X = ben    ssss
TRUE

?- ganteng(ando)
FALSE 




f(a).
f(b).
g(a).
g(b).
h(b).
k(X):- f(X), g(X), h(X).




X = Y 
k(Y).
 - k(Y):
    -- f(Y), g(Y), h(Y).
     -INTS -> Y = a :
        --- f(a), g(a), h(a).
          - T     T     F
    -- f(Y), g(Y), h(Y).
     -INTS -> Y = b : 
        --- f(b), g(b), h(b).
          -  T    T     T 
          - True


loves(vincent,mia).
loves(marsellus,mia).

jealous(A,B):-loves(A,C),loves(B,C).

?- jealous(X,Y).
  -- X = A , Y = B
   --jealous(A,B):-loves(A,C),loves(B,C).
        loves(B,C)
            vincent 
            %mia
        loves(A,C)
            vincent
            %mia
    jealous(vincent,vincent)


    --jealous(A,B):-loves(A,C),loves(B,C).
        loves(B,C)
            vincent 
            %mia
        loves(A,C)
            marsellus
            %mia
    jealous(vincent,marsellus)


X = vincent
Y = vvvv
X = vvvv 
Y = marr



teman_saya(aZISSSSS).
teman_saya(temannya(X)) :-teman_saya(X).
?- teman_saya(P).
P = aZISSSSS



[H|T] -> H(buntut)

member(X,[X|T]). %false 
member(X,[H|T]):- member(X,T).

?- member(vincent,[yolanda,trudy,vincent,jules])


vincent = [yolanda | trudy,vincent,jules]
atom    = atom

member(vincent,[yolanda,trudy,vincent,jules]):- member(vincent,[trudy,vincent,jules]).
                [_|T]
                _ = yolanda 2gb
                T = [trudy,vincent,jules]

member(vincent,[trudy,vincent,jules]).
vincent = [trudy]


[a,a,a,a] 
[b,b,b,b]


a2b([],[]).
a2b(kontol).

      [A]
      []
a2b([a|L1],[b|L2]):- a2b([a,a,a],L2):- 

                    a2b([a|[a,a,a]],[b|L2]):
                             /\      \
                            /  \      |
                           /    \      |
                          F     F     a2b([a|[a,a]],[b|L2]): 
                                             /\    \
                                            /  |     \
                                           F   F    a2b([a|[a]],[b|L2]): 
                                                         |    |    |                   
                                                         F    F    T 
                                                                  a2b([a|[]],[b|[]]):
                                                                     |   |   |
                                                                     F   F   F 













